zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_common.h
/***************************************************************************//**
* \file cy_crypto_common.h
* \version 2.150.1
*
* \brief
*  This file provides common constants and parameters
*  for the Crypto driver.
*
********************************************************************************
* \copyright
* (c) 2020-2026, Infineon Technologies AG or an affiliate of
* Infineon Technologies AG.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/


#if !defined (CY_CRYPTO_COMMON_H)
#define CY_CRYPTO_COMMON_H

#include "cy_device.h"
#include "cy_device_headers.h"

#if defined (CY_IP_MXCRYPTO)

#include "cy_crypto_config.h"
#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

#include <stddef.h>
#include <stdbool.h>
#include "cy_sysint.h"

/** Driver major version */
#define CY_CRYPTO_DRV_VERSION_MAJOR         2

/** Driver minor version */
#define CY_CRYPTO_DRV_VERSION_MINOR         150


/** Rounds off value to nearest multiple of 32 */
#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
/** Rounds off size x in bytes to nearest multiple of 32 */
#define CY_CRYPTO_ALIGN_CACHE_LINE(x)        ((uint32_t)(((x) + 31u) & ~31u))
/** Rounds off size x in int word to nearest multiple of 32 */
#define CY_CRYPTO_ALIGN_CACHE_LINE_WORD(x)   (CY_CRYPTO_ALIGN_CACHE_LINE(x*4u)/4u)
#define CY_CRYPTO_DCAHCE_PADDING_SIZE        (__SCB_DCACHE_LINE_SIZE)
#define CY_CRYPTO_DCAHCE_PADDING_SIZE_WORD   (__SCB_DCACHE_LINE_SIZE/4u)
#define TYPE                                 uint8_t

#define CY_CRYPTO_PADDING_FILLSIZE           dummy[__SCB_DCACHE_LINE_SIZE];
/* Fill CACHE line size dummy bytes */
#define CY_CRYPTO_DCAHCE_PADDING_BYTES       TYPE CY_CRYPTO_PADDING_FILLSIZE

#define CY_CRYPTO_PADDING_ALIGN_FILLSIZE(x, y)  dummy_##y[CY_CRYPTO_ALIGN_CACHE_LINE(x)-((uint32_t)x)];
/* Fill dummy bytes to align to 32byte multiple size.(x-size, y-number to append for naming resolution */
#define CY_CRYPTO_DCAHCE_ALIGN_NEXT(x, y)       TYPE CY_CRYPTO_PADDING_ALIGN_FILLSIZE(x, y)
/* returns 32 byte aligned address */
#define CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(x)    CY_CRYPTO_ALIGN_CACHE_LINE((uint32_t)x)
/*(((uint32_t)x) + (((uint32_t)__SCB_DCACHE_LINE_SIZE) - (((uint32_t)x) & 0x1Fu)))*/
#else
#define CY_CRYPTO_ALIGN_CACHE_LINE(x)        (x)
#define CY_CRYPTO_ALIGN_CACHE_LINE_WORD(x)   (x)
#define CY_CRYPTO_DCAHCE_PADDING_SIZE        (0u)
#define CY_CRYPTO_DCAHCE_PADDING_SIZE_WORD   (0u)
#define CY_CRYPTO_DCAHCE_PADDING_BYTES
#define CY_CRYPTO_DCAHCE_ALIGN_NEXT(x,y)
#define CY_CRYPTO_DCAHCE_ALIGN_ADDRESS(x)    ((uint32_t)x)
#endif /* #if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55) */


#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
#define CRYPTO_MEM_ALIGN /*CY_ALIGN(__SCB_DCACHE_LINE_SIZE)*/
#else
#define CRYPTO_MEM_ALIGN
#endif

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
//#define CRYPTO_MEM_ALIGN_4  CRYPTO_MEM_ALIGN
#define CRYPTO_MEM_ALIGN_4  CY_ALIGN(4)
#else
#define CRYPTO_MEM_ALIGN_4  CY_ALIGN(4)
#endif

/* Enable SHA functionality */
#if !defined(CPUSS_CRYPTO_SHA) && (defined(CPUSS_CRYPTO_SHA1) || defined(CPUSS_CRYPTO_SHA2))
    #define CPUSS_CRYPTO_SHA                (1)

    #if defined(CPUSS_CRYPTO_SHA2) && !defined(CPUSS_CRYPTO_SHA256)
    #define CPUSS_CRYPTO_SHA256             (1)
    #endif

    #if defined(CPUSS_CRYPTO_SHA2) && !defined(CPUSS_CRYPTO_SHA512)
    #define CPUSS_CRYPTO_SHA512             (1)
    #endif
#endif

#if !defined(CPUSS_CRYPTO_STR)
    #define CPUSS_CRYPTO_STR                (1)
#endif

#if !defined(CPUSS_CRYPTO_CHACHA) && defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
#define CPUSS_CRYPTO_CHACHA (0)
#endif

#if !defined(CPUSS_CRYPTO_GCM) && defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
#define CPUSS_CRYPTO_GCM (0)
#endif

#if !defined(CPUSS_CRYPTO_SHA3) && defined(CY_CRYPTO_CFG_HW_V1_ENABLE)
#define CPUSS_CRYPTO_SHA3 (0)
#endif

/** \cond INTERNAL */

/* The width of the Crypto hardware registers values in bits. */
#define CY_CRYPTO_HW_REGS_WIDTH             (32UL)

/* Calculates the actual size in bytes of the bits value */
#define CY_CRYPTO_BYTE_SIZE_OF_BITS(x)      (uint32_t)(((uint32_t)(x) + 7U) >> 3U)

/* Calculates the actual size in 32-bit words of the bits value */
#define CY_CRYPTO_WORD_SIZE_OF_BITS(x)      (uint32_t)(((uint32_t)(x) + 31U) >> 5U)

/** \endcond */

/**
* \addtogroup group_crypto_cli_srv_macros
* \{
*/

/** Defines Crypto_Sync blocking execution type parameter */
#define CY_CRYPTO_SYNC_BLOCKING           (true)

/** Defines Crypto_Sync non-blocking execution type parameter */
#define CY_CRYPTO_SYNC_NON_BLOCKING       (false)

/** Defines the Crypto DES block size (in bytes). */
#define CY_CRYPTO_DES_BLOCK_SIZE          (8u)

/** Defines the Crypto DES key size (in bytes) */
#define CY_CRYPTO_DES_KEY_SIZE            (CY_CRYPTO_DES_BLOCK_SIZE)

/** Defines the Crypto TDES key size (in bytes) */
#define CY_CRYPTO_TDES_KEY_SIZE           (24u)


#if defined(CY_CRYPTO_CFG_AES_C)

/** Defines the Crypto AES block size (in bytes) */
#define CY_CRYPTO_AES_BLOCK_SIZE          (16u)

/** Defines the Crypto AES_128 key maximum size (in bytes) */
#define CY_CRYPTO_AES_128_KEY_SIZE        (16u)

/** Defines the Crypto AES_192 key maximum size (in bytes) */
#define CY_CRYPTO_AES_192_KEY_SIZE        (24u)

/** Defines the Crypto AES_256 key maximum size (in bytes) */
#define CY_CRYPTO_AES_256_KEY_SIZE        (32u)

/** Defines the Crypto AES key maximum size (in bytes) */
#define CY_CRYPTO_AES_MAX_KEY_SIZE        (CY_CRYPTO_AES_256_KEY_SIZE)

/** Defines the Crypto AES_256 key maximum size (in four-byte words) */
#define CY_CRYPTO_AES_MAX_KEY_SIZE_U32    (uint32_t)(CY_CRYPTO_AES_MAX_KEY_SIZE / 4UL)

/** Defines size of the AES block, in four-byte words */
#define CY_CRYPTO_AES_BLOCK_SIZE_U32      (uint32_t)(CY_CRYPTO_AES_BLOCK_SIZE / 4UL)

/** Defines the Crypto AES GCM IV size (in bytes) */
#define CY_CRYPTO_AES_GCM_IV_SIZE          (12u)

#endif /* defined(CY_CRYPTO_CFG_AES_C) */

#if (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C)

/* Defines for the SHA algorithm */
/** Block size for the SHA256 mode (in bytes)   */
#define CY_CRYPTO_SHA256_BLOCK_SIZE         (64u)
/** Pad size for the SHA256 mode (in bytes)   */
#define CY_CRYPTO_SHA256_PAD_SIZE           (56uL)

/** Block size for the SHA512 mode (in bytes)   */
#define CY_CRYPTO_SHA512_BLOCK_SIZE         (128u)
/** Pad size for the SHA512 mode (in bytes)   */
#define CY_CRYPTO_SHA512_PAD_SIZE           (112uL)

#if defined(CY_CRYPTO_CFG_SHA3_ENABLED)
/** SHA3 state size for the SHA modes (in bytes)   */
#define CY_CRYPTO_SHA3_STATE_SIZE        (200u)
/** Block size for the SHA224 mode (in bytes) */
#define CY_CRYPTO_SHA3_224_BLOCK_SIZE        (144u)
/** Block size for the SHA256 mode (in bytes) */
#define CY_CRYPTO_SHA3_256_BLOCK_SIZE        (136u)
/** Block size for the SHA384 mode (in bytes) */
#define CY_CRYPTO_SHA3_384_BLOCK_SIZE        (104u)
/** Block size for the SHA512 mode (in bytes) */
#define CY_CRYPTO_SHA3_512_BLOCK_SIZE        (72u)
/** SHA3 maximum digest size (in bytes) */
#define CY_CRYPTO_SHA3_MAX_DIGEST_SIZE       (64u)
#endif

/** \cond INTERNAL */
#define CY_REMAP_ADDRESS_FOR_CRYPTO(addr)   (CY_REMAP_ADDRESS_CBUS_TO_SAHB(addr))
#define CY_REMAP_ADDRESS_FOR_CPU(addr)      (CY_REMAP_ADDRESS_SAHB_TO_CBUS(addr))
/** \endcond */

