zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_common.h
#if (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED)
    CY_CRYPTO_MODE_SHA384        = 0x03u,   /**< Sets the SHA384 mode */
    CY_CRYPTO_MODE_SHA512        = 0x04u,   /**< Sets the SHA512 mode */
    CY_CRYPTO_MODE_SHA512_256    = 0x05u,   /**< Sets the SHA512/256 mode */
    CY_CRYPTO_MODE_SHA512_224    = 0x06u,   /**< Sets the SHA512/224 mode */
#endif /* (CPUSS_CRYPTO_SHA512 == 1) && defined(CY_CRYPTO_CFG_SHA2_512_ENABLED) */
    CY_CRYPTO_MODE_SHA_NONE    = 0x07u,   /**< Sets the SHA None mode */

#if (CPUSS_CRYPTO_SHA3 == 1) && defined(CY_CRYPTO_CFG_SHA3_ENABLED)
    CY_CRYPTO_MODE_SHA3_224        = 0x07u,   /**< Sets the SHA3-224 mode */
    CY_CRYPTO_MODE_SHA3_256        = 0x08u,   /**< Sets the SHA3-256 mode */
    CY_CRYPTO_MODE_SHA3_384        = 0x09u,   /**< Sets the SHA3-384 mode */
    CY_CRYPTO_MODE_SHA3_512        = 0x0Au,   /**< Sets the SHA3-512 mode */
#endif /* (CPUSS_CRYPTO_SHA3 == 1) */


} cy_en_crypto_sha_mode_t;
#endif /* (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C) */

#if defined(CY_CRYPTO_CFG_RSA_C) && defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
/** Signature verification status */
typedef enum
{
    CY_CRYPTO_RSA_VERIFY_SUCCESS = 0x00u,   /**< PKCS1-v1.5 verify SUCCESS */
    CY_CRYPTO_RSA_VERIFY_FAIL    = 0x01u    /**< PKCS1-v1.5 verify FAILED */
} cy_en_crypto_rsa_ver_result_t;
#endif /* defined(CY_CRYPTO_CFG_RSA_C) && defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */

/** Errors of the Crypto block */
typedef enum
{
    /** Operation completed successfully. */
    CY_CRYPTO_SUCCESS             = 0x00u,

    /** A hardware error occurred, detailed information is in stc_crypto_hw_error_t. */
    CY_CRYPTO_HW_ERROR            = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x01u,

    /** The size of input data is not multiple of 16. */
    CY_CRYPTO_SIZE_NOT_X16        = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x02u,

    /** The key for the DES method is weak. */
    CY_CRYPTO_DES_WEAK_KEY        = CY_CRYPTO_ID | CY_PDL_STATUS_WARNING | 0x03u,

    /** Communication between the client and server via IPC is broken. */
    CY_CRYPTO_COMM_FAIL           = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x04u,

    /** The Crypto server is not started. */
    CY_CRYPTO_SERVER_NOT_STARTED  = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x06u,

    /** The Crypto server in process state. */
    CY_CRYPTO_SERVER_BUSY         = CY_CRYPTO_ID | CY_PDL_STATUS_INFO    | 0x07u,

    /** The Crypto driver is not initialized. */
    CY_CRYPTO_NOT_INITIALIZED     = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x08u,

    /** The Crypto hardware is not enabled. */
    CY_CRYPTO_HW_NOT_ENABLED      = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x09u,

    /** The Crypto operation is not supported. */
    CY_CRYPTO_NOT_SUPPORTED       = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x0Au,

    /** The Crypto operation parameters are incorrect. */
    CY_CRYPTO_BAD_PARAMS          = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x0Bu,

    /** TRNG generated is not a healthy random number. */
    CY_CRYPTO_TRNG_UNHEALTHY      = CY_CRYPTO_ID | CY_PDL_STATUS_WARNING | 0x0Cu,

    /** Memory allocation for Crypto operation failed. */
    CY_CRYPTO_MEMORY_ALLOC_FAIL   = CY_CRYPTO_ID | CY_PDL_STATUS_ERROR   | 0x0Du

} cy_en_crypto_status_t;

/**
 * EDDSA signature operation type.
 *
 * It identifies the signature operation type (pure, ctx or prehash).
 */
typedef enum cy_en_eddsa_sig_type_t
{
    CY_CRYPTO_EDDSA_PURE = 0,   /*!< Pure - uses the entire message, without hashing it previously. */
    CY_CRYPTO_EDDSA_CTX,        /*!< Deterministic context - uses the entire message, without hashing it previously. */
    CY_CRYPTO_EDDSA_PREHASH,    /*!< Pre-hashed message - uses the already hashed message. */
    CY_CRYPTO_EDDSA_NONE        /*!< None - not a valid choice. */
} cy_en_eddsa_sig_type_t;


/** \} group_crypto_enums */

/**
* \addtogroup group_crypto_lld_asymmetric_enums
* \{
*/

#if (CPUSS_CRYPTO_VU == 1) && defined (CY_CRYPTO_CFG_ECP_C)
/** List of supported elliptic curve IDs */
typedef enum {
    CY_CRYPTO_ECC_ECP_NONE = 0,
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED)
    CY_CRYPTO_ECC_ECP_SECP192R1,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP192R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED)
    CY_CRYPTO_ECC_ECP_SECP224R1,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP224R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED)
    CY_CRYPTO_ECC_ECP_SECP256R1,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP256R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED)
    CY_CRYPTO_ECC_ECP_SECP384R1,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP384R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED)
    CY_CRYPTO_ECC_ECP_SECP521R1,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_SECP521R1_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_ED25519_ENABLED)
    CY_CRYPTO_ECC_ECP_ED25519,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_ED25519_ENABLED) */
#if defined(CY_CRYPTO_CFG_ECP_DP_EC25519_ENABLED)
    CY_CRYPTO_ECC_ECP_EC25519,
#endif /* defined(CY_CRYPTO_CFG_ECP_DP_EC25519_ENABLED) */
    /* Count of supported curves */
    CY_CRYPTO_ECC_ECP_CURVES_CNT
} cy_en_crypto_ecc_curve_id_t;

#endif /* (CPUSS_CRYPTO_VU == 1) && defined (CY_CRYPTO_CFG_ECP_C) */

/** \} group_crypto_lld_asymmetric_enums */

/** \cond INTERNAL */

/** Instruction to communicate between Client and Server */
typedef enum
{
    CY_CRYPTO_INSTR_UNKNOWN      = 0x00u,
    CY_CRYPTO_INSTR_ENABLE       = 0x01u,
    CY_CRYPTO_INSTR_DISABLE      = 0x02u,

#if (CPUSS_CRYPTO_PR == 1) && defined(CY_CRYPTO_CFG_PRNG_C)
    CY_CRYPTO_INSTR_PRNG_INIT    = 0x03u,
    CY_CRYPTO_INSTR_PRNG         = 0x04u,
#endif /* (CPUSS_CRYPTO_PR == 1) && defined(CY_CRYPTO_CFG_PRNG_C) */

#if (CPUSS_CRYPTO_TR == 1) && defined(CY_CRYPTO_CFG_TRNG_C)
    CY_CRYPTO_INSTR_TRNG_INIT    = 0x05u,
    CY_CRYPTO_INSTR_TRNG         = 0x06u,
#endif /* (CPUSS_CRYPTO_TR == 1) && defined(CY_CRYPTO_CFG_TRNG_C) */

#if (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C)
    CY_CRYPTO_INSTR_AES_INIT     = 0x07u,
    CY_CRYPTO_INSTR_AES_ECB      = 0x08u,

#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC)
    CY_CRYPTO_INSTR_AES_CBC      = 0x09u,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CBC) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB)
    CY_CRYPTO_INSTR_AES_CFB      = 0x0Au,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CFB) */
#if defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR)
    CY_CRYPTO_INSTR_AES_CTR      = 0x0Bu,
#endif /* defined(CY_CRYPTO_CFG_CIPHER_MODE_CTR) */
#endif /* (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C) */

#if (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_CMAC_C)
    CY_CRYPTO_INSTR_CMAC         = 0x0Cu,
#endif /* (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_CMAC_C) */

#if (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C)
    CY_CRYPTO_INSTR_SHA          = 0x0Du,
#endif /* (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C) */

#if (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_HMAC_C)
    CY_CRYPTO_INSTR_HMAC         = 0x0Eu,
#endif /* (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_HMAC_C) */

#if (CPUSS_CRYPTO_STR == 1)
    CY_CRYPTO_INSTR_MEM_CPY      = 0x0Fu,
    CY_CRYPTO_INSTR_MEM_SET      = 0x10u,
    CY_CRYPTO_INSTR_MEM_CMP      = 0x11u,
    CY_CRYPTO_INSTR_MEM_XOR      = 0x12u,
#endif /* (CPUSS_CRYPTO_STR == 1) */

#if (CPUSS_CRYPTO_CRC == 1) && defined(CY_CRYPTO_CFG_CRC_C)
    CY_CRYPTO_INSTR_CRC_INIT     = 0x13u,
    CY_CRYPTO_INSTR_CRC          = 0x14u,
#endif /* (CPUSS_CRYPTO_CRC == 1) && defined(CY_CRYPTO_CFG_CRC_C) */

