zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_common.h
#if (CPUSS_CRYPTO_DES == 1) && defined(CY_CRYPTO_CFG_DES_C)
    CY_CRYPTO_INSTR_DES          = 0x15u,
    CY_CRYPTO_INSTR_3DES         = 0x16u,
#endif /* (CPUSS_CRYPTO_DES == 1) && defined(CY_CRYPTO_CFG_DES_C) */

#if (CPUSS_CRYPTO_VU == 1) && defined(CY_CRYPTO_CFG_RSA_C)
    CY_CRYPTO_INSTR_RSA_PROC     = 0x17u,
    CY_CRYPTO_INSTR_RSA_COEF     = 0x18u,

#if defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED)
#if (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C)
    CY_CRYPTO_INSTR_RSA_VER      = 0x19u,
#endif /* (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C) */
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) */

#endif /* (CPUSS_CRYPTO_VU == 1) && defined(CY_CRYPTO_CFG_RSA_C) */

    CY_CRYPTO_INSTR_SRV_INFO     = 0x55u,

#if (CPUSS_CRYPTO_VU == 1)
#if defined(CY_CRYPTO_CFG_RSA_C)
    CY_CRYPTO_INSTR_MEMBUF_SET   = 0x56u,
    CY_CRYPTO_INSTR_MEMBUF_ADDR  = 0x57u,
    CY_CRYPTO_INSTR_MEMBUF_SIZE  = 0x58u,
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */

#if defined(CY_CRYPTO_CFG_ECP_C)
    CY_CRYPTO_INSTR_ECC_GET_DP   = 0x59u,
    CY_CRYPTO_INSTR_ECC_ECP_MUL  = 0x5Au,
#endif /* defined(CY_CRYPTO_CFG_ECP_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_GENKEY_C)
    CY_CRYPTO_INSTR_ECP_GEN_PRIK = 0x5Bu,
    CY_CRYPTO_INSTR_ECP_GEN_PUBK = 0x5Cu,
#endif /* defined(CY_CRYPTO_CFG_ECDSA_GENKEY_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_SIGN_C)
    CY_CRYPTO_INSTR_ECDSA_SIGN   = 0x5Du,
#endif /* defined(CY_CRYPTO_CFG_ECDSA_SIGN_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_VERIFY_C)
    CY_CRYPTO_INSTR_ECDSA_VER    = 0x5Eu
#endif /* defined(CY_CRYPTO_CFG_ECDSA_VERIFY_C) */
#endif /* (CPUSS_CRYPTO_VU == 1) */

} cy_en_crypto_comm_instr_t;

/** \endcond */

/**
* \addtogroup group_crypto_data_structures
* \{
*/

#if (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C)

/** The structure for storing the AES state.
* All fields for this structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/

/* The structure to define used memory buffers */

typedef struct
{
    /** \cond INTERNAL */
    uint32_t key[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_MAX_KEY_SIZE_U32)];
    uint32_t keyInv[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_MAX_KEY_SIZE_U32)];
    uint32_t block0[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_BLOCK_SIZE_U32)];
    uint32_t block1[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_BLOCK_SIZE_U32)];
    uint32_t block2[CY_CRYPTO_ALIGN_CACHE_LINE_WORD(CY_CRYPTO_AES_BLOCK_SIZE_U32)];
    uint8_t unProcessedData[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    uint8_t iv[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** \endcond */
} cy_stc_crypto_aes_buffers_t;



typedef struct
{
    /** \cond INTERNAL */
    /** Pointer to AES work buffers */
     cy_stc_crypto_aes_buffers_t *buffers;
    /** AES key length */
    cy_en_crypto_aes_key_length_t keyLength;
    /** AES processed block index (for CMAC, SHA operations) */
    uint32_t blockIdx;
    /** AES unprocessed message block*/
    uint32_t unProcessedBytes;
    /** AES ivSize*/
    uint16_t ivSize;
    /** AES mode*/
    cy_en_crypto_dir_mode_t dirMode;
    /** align next member to cache line size */
    CY_CRYPTO_DCAHCE_ALIGN_NEXT(22,0)
    /** \endcond */
} cy_stc_crypto_aes_state_t;
#endif /* (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_AES_C) */


#if (CPUSS_CRYPTO_AES == 1) && defined(CY_CRYPTO_CFG_CCM_C)
/** The structure for storing the AES CCM state.
* All fields for this structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/

/* The structure to define used memory buffers */
 typedef struct
{
    /** \cond INTERNAL */
    /** AES CBC MAC buffer */
     cy_stc_crypto_aes_buffers_t aesCbcMacBuffer;
    /** AES CTR buffer */
     cy_stc_crypto_aes_buffers_t aesCtrBuffer;
    /** Counter buffer */
     uint8_t ctr[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** Y buffer */
     uint8_t y[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** temp buffer */
    CRYPTO_MEM_ALIGN_4 uint8_t temp_buffer[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** \endcond */
} cy_stc_crypto_aes_ccm_buffers_t;

typedef struct
{
    /** \cond INTERNAL */
    /** Pointer to AES work buffers */
    cy_stc_crypto_aes_state_t aesCbcMacState;
    /** Operation data descriptors */
    cy_stc_crypto_aes_state_t aesCtrState;
    /** pointer to temp buffer */
    uint8_t *temp;
    /** pointer to ctr buffer */
    uint8_t *ctr;
    /** pointer to y buffer */
    uint8_t *y;
    /** AES direction */
    cy_en_crypto_dir_mode_t dirMode;
    /** Length field Size*/
    uint32_t L;
    /** Total text size*/
    uint32_t textLength;
    /** Total AAD size*/
    uint32_t aadLength;
    /** Total tag size*/
    uint8_t tagLength;
    /** AAD size processed*/
    uint32_t aadLengthProcessed;
    /** AAD processed flag*/
    bool isAadProcessed;
    /** IV set flag*/
    bool isIvSet;
    /** Length Set flag*/
    bool isLengthSet;
    /** \endcond */
} cy_stc_crypto_aes_ccm_state_t;
#endif

#if (CPUSS_CRYPTO_GCM == 1u) && defined(CY_CRYPTO_CFG_GCM_C)

/** The structure for storing the AES GCM state.
* All fields for this structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/

/* The structure to define used memory buffers */

 typedef struct
{
    /** \cond INTERNAL */
    /** AES GCM Ghash buffer Block */
     uint8_t  y[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** AES GCM temp buffer for AAD data */
     uint8_t  temp[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** AES GCM aes data buffer*/
     uint8_t  aes_data[CY_CRYPTO_ALIGN_CACHE_LINE(CY_CRYPTO_AES_BLOCK_SIZE)];
    /** AES ECB buffer */
    cy_stc_crypto_aes_buffers_t aes_buffer;
    /** AES GCM Hash Subkey */
     uint8_t  h[CY_CRYPTO_AES_BLOCK_SIZE];
    /** AES GCM Initial Counter BLock*/
     uint8_t  icb[CY_CRYPTO_AES_BLOCK_SIZE];
    /** AES GCM Counter Block */
     uint8_t  cb[CY_CRYPTO_AES_BLOCK_SIZE];
    /** \endcond */
} cy_stc_crypto_aes_gcm_buffers_t;

 typedef struct cy_stc_crypto_aes_gcm_state
{
    /** \cond INTERNAL */
    /**AES state*/
     cy_stc_crypto_aes_state_t  aesState;
    /**Pointer to the AES buffer*/
    cy_stc_crypto_aes_buffers_t *aes_buffer;
    /** AES GCM hash key pointer */
    uint8_t *h;
    /**AES GCM Initial Counter block */
    uint8_t *icb;
    /** AES GCM Counter block */
    uint8_t *cb;
    /** Pointer to ghash buffer */
    uint8_t *y;
    /** pointer to temp buffer*/
    uint8_t *temp;
    /**Pointer to hold the last AES block*/
    uint8_t *aes_data;
    /** AES GCM total data processed*/
    uint32_t data_size;
    /** AES GCM total AAD data processed*/
    uint32_t aad_size;
    /** AES GCM partial AAD data processed flag*/
    bool partial_aad_processed;
    /**Mode of the AES GCM operation */
    cy_en_crypto_dir_mode_t mode;
    /** \endcond */
} cy_stc_crypto_aes_gcm_state_t;

#endif /* (CPUSS_CRYPTO_GCM == 1) && defined(CY_CRYPTO_CFG_GCM_C)*/
#if (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C)

/** The structure for storing the SHA state.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
 typedef struct
{
    /** \cond INTERNAL */
    uint32_t mode;
    uint32_t modeHw;
    uint8_t *block;
    uint32_t blockSize;
    uint8_t *hash;
    uint32_t hashSize;
    uint8_t *roundMem;
    uint32_t roundMemSize;
    uint64_t messageSize;
    uint32_t digestSize;
    uint32_t blockIdx;
    uint8_t  const *initialHash;
    /** align next member to cache line size */
    CY_CRYPTO_DCAHCE_ALIGN_NEXT(52,0)
    /** \endcond */
} cy_stc_crypto_sha_state_t;

