zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_common.h
/** The structure for storing the TRNG context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    /**
     The polynomial for the programmable Galois ring oscillator (TR_GARO_CTL).
     The polynomial is represented WITHOUT the high order bit (this bit is
     always assumed '1').
     The polynomial should be aligned so that more significant bits
     (bit 30 and down) contain the polynomial and less significant bits
     (bit 0 and up) contain padding '0's. */
    uint32_t GAROPol;

    /**
     The polynomial for the programmable Fibonacci ring oscillator(TR_FIRO_CTL).
     The polynomial is represented WITHOUT the high order bit (this bit is
     always assumed '1').
     The polynomial should be aligned so that more significant bits
     (bit 30 and down) contain the polynomial and less significant bits
     (bit 0 and up) contain padding '0's. */
    uint32_t FIROPol;
    /** Maximum of the generated value */
    uint32_t max;
    /** Pointer to generated value */
    uint32_t *trngNum;
    /** \endcond */
} cy_stc_crypto_context_trng_t;
#endif /* (CPUSS_CRYPTO_TR == 1) && defined(CY_CRYPTO_CFG_TRNG_C) */

#if (CPUSS_CRYPTO_STR == 1)
/** The structure for storing the string context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    void const *src0;         /**<  Pointer to 1-st string source */
    void const *src1;         /**<  Pointer to 2-nd string source */
    void       *dst;          /**<  Pointer to string destination */
    uint32_t   dataSize;      /**<  Operation data size */
    uint32_t   data;          /**<  Operation data value (for memory setting) */
    /** \endcond */
} cy_stc_crypto_context_str_t;
#endif /* (CPUSS_CRYPTO_STR == 1) */

#if (CPUSS_CRYPTO_CRC == 1) && defined(CY_CRYPTO_CFG_CRC_C)
/** The structure for storing the CRC context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    void*    data;                  /**<  Pointer to data source block */
    uint32_t dataSize;              /**<  Operation data size */
    uint32_t *crc;                  /**<  Pointer to CRC destination variable */
    uint32_t polynomial;            /**<  Polynomial for CRC calculate */
    uint32_t lfsrInitState;         /**<  CRC calculation initial value */
    uint32_t dataReverse;           /**<  Input data reverse flag */
    uint32_t dataXor;               /**<  Input data  XOR flag */
    uint32_t remReverse;            /**<  Output data reverse flag */
    uint32_t remXor;                /**<  Output data XOR flag */
    /** \endcond */
} cy_stc_crypto_context_crc_t;
#endif /* (CPUSS_CRYPTO_CRC == 1) && defined(CY_CRYPTO_CFG_CRC_C) */

#if (CPUSS_CRYPTO_VU == 1)
#if defined(CY_CRYPTO_CFG_RSA_C)
/** The structure for storing the RSA context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    /** Pointer to key data */
    cy_stc_crypto_rsa_pub_key_t const *key;
    /** Pointer to data source block */
    uint32_t const *message;
    /** Operation data size */
    uint32_t messageSize;
    /** Pointer to data destination block */
    uint32_t *result;
    /** \endcond */
} cy_stc_crypto_context_rsa_t;

#if defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) && (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C)
/** The structure for storing the RSA verification context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in the function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    /** Pointer to verification result /ref cy_en_crypto_rsa_ver_result_t */
    cy_en_crypto_rsa_ver_result_t *verResult;
    /** SHA digest type, used with SHA calculation of the message */
    cy_en_crypto_sha_mode_t digestType;
    /** SHA digest of the message, calculated with digestType */
    uint32_t const *hash;
    /** Previously decrypted RSA signature */
    uint32_t const *decryptedSignature;
    /** Length of the decrypted RSA signature */
    uint32_t decryptedSignatureLength;
    /** \endcond */
} cy_stc_crypto_context_rsa_ver_t;
#endif /* defined(CY_CRYPTO_CFG_RSA_VERIFY_ENABLED) && (CPUSS_CRYPTO_SHA == 1) && defined(CY_CRYPTO_CFG_SHA_C) */
#endif /* defined(CY_CRYPTO_CFG_RSA_C) */

#if defined(CY_CRYPTO_CFG_ECDSA_C)
/** The structure for storing the ECC operations context.
* All fields for the context structure are internal. Firmware never reads or
* writes these values. Firmware allocates the structure and provides the
* address of the structure to the driver in function calls. Firmware must
* ensure that the defined instance of this structure remains in scope
* while the drive is in use.
*/
typedef struct
{
    /** \cond INTERNAL */
    /** Elliptic curve ID */
    cy_en_crypto_ecc_curve_id_t curveID;
    /** Pointer to key data */
    const cy_stc_crypto_ecc_key *key;
    /** Operation data length */
    uint32_t datalen;
    /** Pointer to the first  source data block */
    const uint8_t *src0;
    /** Pointer to the second source data block */
    const uint8_t *src1;
    /** Pointer to the third  source data block */
    const uint8_t *src2;
    /** Pointer to the first  destination data block */
    uint8_t *dst0;
    /** Pointer to the second destination data block */
    uint8_t *dst1;
    /** \endcond */
} cy_stc_crypto_context_ecc_t;
#endif /* defined(CY_CRYPTO_CFG_ECDSA_C) */
#endif /* (CPUSS_CRYPTO_VU == 1) */


#if defined(CY_CRYPTO_CFG_CHACHA_ENABLED) && (CPUSS_CRYPTO_CHACHA == 1)

/** Defines the chacha state size (in bytes) */
#define CHACHA_STATE_SIZE 64u

