zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_crypto_common.h
/** Defines the chacha key stream size (in bytes) */
#define CHACHA_KEYSTREAM_SIZE 64u

/** Defines the chacha state block size (in bytes) */
#define CHACHA_BLOCK_SIZE 64u

/** \cond INTERNAL */

/** Defines the chacha key size (in bytes) */
#define CHACHA_KEY_SIZE 32u

/** Defines the chacha nonce size (in bytes) */
#define CHACHA_NONCE_SIZE 12u

/** Defines the chacha counter size (in bytes) */
#define CHACHA_COUNTER_SIZE 4u

/** Defines the chacha const size (in bytes) */
#define CHACHA_CONST_SIZE 16u
/** \endcond */

 typedef struct
{
    /** \cond INTERNAL */
    /** buffer to store the nonce*/
     uint8_t nonce[CY_CRYPTO_ALIGN_CACHE_LINE(CHACHA_NONCE_SIZE)];
    /** To store the counter*/
     uint32_t counter;
    /** align next member to cache line size */
    CY_CRYPTO_DCAHCE_ALIGN_NEXT(sizeof(uint32_t),0)
    /** buffer to store the chacha key*/
    uint8_t key[CY_CRYPTO_ALIGN_CACHE_LINE(CHACHA_KEY_SIZE)];
    /** buffer to store the constant*/
    uint32_t constant[CHACHA_CONST_SIZE/4u];
    /** \endcond */
}cy_stc_crypto_v2_chacha_input_buffer;

 typedef struct
{
    /** \cond INTERNAL */
    /** The pointer to store chacha state */
    cy_stc_crypto_v2_chacha_input_buffer *state;
    /** The pointer to chacha key stream */
    uint8_t *key;
    /** To store the chacha key bytes used */
    uint8_t keyIndexUsed;
     /** To store the rounds for the chacha operation*/
    uint8_t round;


    /** \endcond */
} cy_stc_crypto_chacha_state_t;

#endif

#if defined(CY_CRYPTO_CFG_CCM_C)
/** CCM tag verification status */
typedef enum
{
        /** \cond INTERNAL */
    CY_CRYPTO_CCM_TAG_VALID     = 0x05555555u,
    CY_CRYPTO_CCM_TAG_INVALID   = 0x0AAAAAAAu,
    /** \endcond */
} cy_en_crypto_aesccm_tag_verify_result_t;
#endif

#if (CPUSS_CRYPTO_VU == 1) && defined(CY_CRYPTO_CFG_POLY1305_ENABLED)

/** Defines the poly1305 block size (in bytes) */
#define CY_CRYPTO_POLY1305_BLOCK_SIZE         (16u)

/** Defines the poly1305 key size (in bytes) */
#define CY_CRYPTO_POLY1305_KEY_SIZE         (32u)

/** Defines the poly1305 state size (in bytes) */
#define CY_CRYPTO_POLY1305_STATE_SIZE         (17u)

#endif

/** \} group_crypto_cli_data_structures */

#if defined(__cplusplus)
}
#endif

#endif /* defined(CY_IP_MXCRYPTO) */

#endif /* !defined (CY_CRYPTO_COMMON_H) */


/* [] END OF FILE */
